## Data Alignment

In [1]:
#import libraries
import numpy as np
from pandas import Series,DataFrame

import pandas as pd

In [5]:
#data alignment between series

ser1 = Series([8,18,9],index=list('HRI'))
print("Series 1")
print(ser1)
print()
ser2 = Series([8,18,9,19],index=list('HRIS'))
print("Series 2")
print(ser2)

Series 1
H     8
R    18
I     9
dtype: int64

Series 2
H     8
R    18
I     9
S    19
dtype: int64

In [8]:
#Add Series
ser1 + ser2

H    16.0
I    18.0
R    36.0
S     NaN
dtype: float64

Since S is not present in the first series it is replaced with a NaN value in the addition operation

In [13]:
#Data frame data alignment
df1 = DataFrame(np.arange(9).reshape(3,3),index=list('HRI'),columns=list('SHE'))
print(df1)
print()
df2 = DataFrame(np.arange(16).reshape(4,4),index=list('HRIS'),columns=list('SHET'))
print(df2)

   S  H  E
H  0  1  2
R  3  4  5
I  6  7  8

    S   H   E   T
H   0   1   2   3
R   4   5   6   7
I   8   9  10  11
S  12  13  14  15

In [14]:
df1 + df2

      E     H     S   T
H   4.0   2.0   0.0 NaN
I  18.0  16.0  14.0 NaN
R  11.0   9.0   7.0 NaN
S   NaN   NaN   NaN NaN

Same as series - places that are missing in either are filled with NaN values

In [18]:
df3 = df1.add(df2,fill_value = 0)
df3

      E     H     S     T
H   4.0   2.0   0.0   3.0
I  18.0  16.0  14.0  11.0
R  11.0   9.0   7.0   7.0
S  14.0  13.0  12.0  15.0

Passing in the fill_value param with some fill value ensures that the value of the non common cells are filled with their original values.

Also notice that the values in the matching cells across dataframes were added up because they were numbers